# арифм или геом?
l=[2,3,4,5,6]
if len(l)<3:
    print("список недостаточной длины")
    exit()
if l[1]-l[0]== l[2] - l[1]:
# проверка арифм прогрессии
    d=l[1]-l[0]
    i=2
    while i+1<len(l):
        if l[i+1] - l[i]!=d:
            print("плохой список")
            exit()
        i+=1
    print("арифм прогрессия")
elif l[1]/l[0] == l[2]/l[1]:
# проверка геом прогрессии
    d=l[1]/l[0]
    i=2
    while i+1<len(l):
        if l[i+1] / l[i]!=d:
            print("плохой список")
            exit()
        i+=1
    print("геом прогрессия")
else:
    print("плохой список")

